
## Plan Result (aat)




<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.application_insights.azurerm_monitor_scheduled_query_rules_alert_v2.main[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.application_insights.azurerm_monitor_scheduled_query_rules_alert_v2.main[0] will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "main" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "Monitors for application insight reaching it's daily cap."
      + enabled                                = true
      + evaluation_frequency                   = "PT5M"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "uksouth"
      + name                                   = "Application Insights daily cap reached - docmosis-aat"
      + resource_group_name                    = "docmosis-infrastructure-aat"
      + scopes                                 = [
          + "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/docmosis-infrastructure-aat/providers/Microsoft.Insights/components/docmosis-aat",
        ]
      + severity                               = 3
      + window_duration                        = "PT5M"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups     = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts",
            ]
          + custom_properties = {
              + "from"           = "terraform"
              + "slackChannelId" = "C8SR5CAMU"
            }
        }

      + criteria {
          + operator                = "Equal"
          + query                   = <<-EOT
                AzureActivity 
                | where ResourceId == "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/docmosis-infrastructure-aat/providers/Microsoft.Insights/components/docmosis-aat"
                | where OperationNameValue == "Microsoft.Insights/Components/DailyCapReached/Action"
            EOT
          + threshold               = 0
          + time_aggregation_method = "Count"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":5,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->